import {
  ImportHelper,
  importToolBarItem,
  exportToolBarItem,
} from "@corbe30/fortune-excel";
import { Workbook } from "@fortune-sheet/react";
import { useRef, useState } from "react";
import "@fortune-sheet/react/dist/index.css";
export default function Fortuneexcel() {
  //@ts-ignore
  const workbookRef = useRef();
  const [key, setKey] = useState(0);
  const [sheets, setSheets] = useState([
    {
      name: "سر برگ صفحات",
      rows: {
        "0": {
          cells: {
            "0": {
              text: "شرکت نمونه (سهامی عام)",
            },
          },
        },
        "2": {
          cells: {
            "0": {
              text: "سال مالي منتهی به 29 اسفند 1398",
            },
          },
        },
        "3": {
          cells: {
            "0": {
              text: "سال 1397",
            },
          },
        },
        "4": {
          cells: {
            "0": {
              text: "سال 1398",
            },
          },
        },
        "5": {
          cells: {
            "0": {
              text: "1396/12/29",
            },
          },
        },
        "6": {
          cells: {
            "0": {
              text: "1397/12/29",
            },
          },
        },
        "7": {
          cells: {
            "0": {
              text: "1398/12/29",
            },
          },
        },
        "8": {
          cells: {
            "0": {
              text: "1397/01/01",
            },
          },
        },
        "9": {
          cells: {
            "0": {
              text: "1396",
            },
          },
        },
        "10": {
          cells: {
            "0": {
              text: "1397",
            },
          },
        },
        "11": {
          cells: {
            "0": {
              text: "1398",
            },
          },
        },
        "12": {
          cells: {
            "0": {
              text: "يادداشتهاي توضيحي ، بخش جدایی ناپذیر صورت هاي مالي است .",
            },
          },
        },
        "13": {
          cells: {
            "0": {
              text: "يادداشتهاي توضيحي صورت هاي مالي",
            },
          },
        },
      },
      cols: [
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
      ],
      merges: [],
    },
    {
      name: "سودوزيان",
      rows: {
        "0": {
          cells: {
            "0": {
              text: "شرکت برق منطقه ای ...... (سهامی خاص)",
            },
          },
        },
        "1": {
          cells: {
            "0": {
              text: "صورت سود و زيان",
            },
          },
        },
        "2": {
          cells: {
            "0": {
              text: "سال مالي منتهي به  30 اسفند 1403",
            },
          },
        },
        "4": {
          cells: {
            "6": {
              text: "(مبالغ به میلیون ریال)",
            },
          },
        },
        "5": {
          cells: {
            "8": {
              text: "(تجدید ارائه شده)",
            },
          },
        },
        "6": {
          cells: {
            "4": {
              text: "يادداشت",
            },
            "6": {
              text: "سال 1403",
            },
            "8": {
              text: "سال 1402",
            },
          },
        },
        "8": {
          cells: {
            "1": {
              text: "درآمدهاي عملياتي",
            },
            "4": {
              text: "5",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "9": {
          cells: {
            "1": {
              text: "هزینه های ناشی از اجرای مقررات",
            },
            "4": {
              text: "10",
            },
            "6": {
              text: "(0)",
            },
            "8": {
              text: "(0)",
            },
          },
        },
        "10": {
          cells: {
            "1": {
              text: "بهاي تمام شده درآمدهاي عملياتي",
            },
            "4": {
              text: "6",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "11": {
          cells: {
            "1": {
              text: "سود (زیان) ناخالص",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "12": {
          cells: {
            "1": {
              text: "هزينه هاي فروش ، اداري و عمومي",
            },
            "4": {
              text: "7",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "13": {
          cells: {
            "1": {
              text: "ساير درآمدها",
            },
            "4": {
              text: "8",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "14": {
          cells: {
            "1": {
              text: "ساير هزينه ها",
            },
            "4": {
              text: "9",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "15": {
          cells: {
            "1": {
              text: "سود (زیان) عملياتي",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "16": {
          cells: {
            "1": {
              text: "هزینه های ناشی از اجرای مقررات",
            },
            "4": {
              text: "10",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "17": {
          cells: {
            "1": {
              text: "هزينه هاي مالي",
            },
            "4": {
              text: "11",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "18": {
          cells: {
            "1": {
              text: "ساير درآمدها و هزينه هاي غيرعملياتي",
            },
            "4": {
              text: "12",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "19": {
          cells: {
            "1": {
              text: "سود (زیان) قبل از مالیات",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "20": {
          cells: {
            "1": {
              text: "هزينه مالیات بر درآمد",
            },
            "4": {
              text: "34",
            },
            "6": {
              text: "(0)",
            },
            "8": {
              text: "(0)",
            },
          },
        },
        "21": {
          cells: {
            "1": {
              text: "سود (زیان) خالص",
            },
            "6": {
              text: "23",
            },
            "8": {
              text: "23",
            },
          },
        },
        "23": {
          cells: {
            "1": {
              text: "خالص آثار کمی ناشی از ارائه کالا و خدمات به قیمت تکلیفی",
            },
            "4": {
              text: "45",
            },
            "6": {
              text: "23",
            },
          },
        },
        "26": {
          cells: {
            "0": {
              text: "يادداشت هاي توضيحي ، بخش جدايي ناپذير صورت هاي مالي است.",
            },
          },
        },
      },
      cols: [
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
      ],
      merges: [
        "0:0-0:9",
        "1:0-1:9",
        "2:0-2:9",
        "30:0-30:9",
        "28:0-28:9",
        "5:6-5:7",
        "27:0-27:9",
        "26:0-26:9",
        "4:6-4:8",
      ],
    },
    {
      name: "5",
      rows: {
        "0": {
          cells: {
            "0": {
              text: "شرکت سهامی خاص برق منطقه ای ......",
            },
          },
        },
        "1": {
          cells: {
            "0": {
              text: "شرکت برق منطقه ای ...... (سهامی خاص)",
            },
          },
        },
        "2": {
          cells: {
            "0": {
              text: "يادداشت هاي توضيحي صورت هاي مالي",
            },
            "1": {
              text: "يادداشت هاي توضيحي صورت هاي مالي",
            },
          },
        },
        "3": {
          cells: {
            "0": {
              text: "سال مالي منتهي به  30 اسفند 1403",
            },
          },
        },
        "5": {
          cells: {
            "0": {
              text: "5-",
            },
            "1": {
              text: "درآمدهای عملیاتی",
            },
          },
        },
        "7": {
          cells: {
            "9": {
              text: "1403",
            },
            "15": {
              text: "1402",
            },
          },
        },
        "8": {
          cells: {
            "7": {
              text: "يادداشت",
            },
            "9": {
              text: "مقدار",
            },
            "11": {
              text: "نرخ",
            },
            "13": {
              text: "مبلغ",
            },
            "15": {
              text: "مقدار",
            },
            "17": {
              text: "نرخ",
            },
            "19": {
              text: "مبلغ",
            },
          },
        },
        "9": {
          cells: {
            "9": {
              text: "میلیون کیلووات ساعت",
            },
            "11": {
              text: "ریال",
            },
            "13": {
              text: "ميليون ریال",
            },
            "15": {
              text: "میلیون کیلووات ساعت",
            },
            "17": {
              text: "ریال",
            },
            "19": {
              text: "ميليون ریال",
            },
          },
        },
        "10": {
          cells: {
            "1": {
              text: "فروش برق به مشتركين",
            },
            "7": {
              text: "5-1",
            },
            "9": {
              text: "23",
            },
            "11": {
              text: "23",
            },
            "13": {
              text: "23",
            },
            "15": {
              text: "23",
            },
            "17": {
              text: "23",
            },
            "19": {
              text: "23",
            },
          },
        },
        "11": {
          cells: {
            "1": {
              text: "مابه التفاوت اجرای مقررات",
            },
            "7": {
              text: "5-1",
            },
            "9": {
              text: "-",
            },
            "11": {
              text: "-",
            },
            "13": {
              text: "23",
            },
            "15": {
              text: "-",
            },
            "17": {
              text: "-",
            },
            "19": {
              text: "0",
            },
          },
        },
        "12": {
          cells: {
            "1": {
              text: "فروش برق به شرکت مدیریت شبکه / بازار برق",
            },
            "7": {
              text: "5-2",
            },
            "9": {
              text: "23",
            },
            "11": {
              text: "23",
            },
            "13": {
              text: "23",
            },
            "15": {
              text: "23",
            },
            "17": {
              text: "23",
            },
            "19": {
              text: "23",
            },
          },
        },
        "13": {
          cells: {
            "1": {
              text: "فروش برق به شرکت های توزیع نیروی برق",
            },
            "7": {
              text: "5-3",
            },
            "9": {
              text: "23",
            },
            "11": {
              text: "23",
            },
            "13": {
              text: "23",
            },
            "15": {
              text: "23",
            },
            "17": {
              text: "23",
            },
            "19": {
              text: "23",
            },
          },
        },
        "14": {
          cells: {
            "1": {
              text: "فروش برق - سایر",
            },
            "7": {
              text: "5-4",
            },
            "9": {
              text: "0",
            },
            "11": {
              text: "7",
            },
            "13": {
              text: "0",
            },
            "15": {
              text: "0",
            },
            "17": {
              text: "7",
            },
            "19": {
              text: "0",
            },
          },
        },
        "15": {
          cells: {
            "1": {
              text: "درآمد خدمات انتقال و ترانزیت برق",
            },
            "7": {
              text: "5-5",
            },
            "9": {
              text: "-",
            },
            "13": {
              text: "23",
            },
            "15": {
              text: "-",
            },
            "19": {
              text: "23",
            },
          },
        },
        "16": {
          cells: {
            "9": {
              text: "23",
            },
            "13": {
              text: "23",
            },
            "15": {
              text: "23",
            },
            "19": {
              text: "23",
            },
          },
        },
      },
      cols: [
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
        {
          len: 120,
        },
      ],
      merges: [
        "16:0-16:5",
        "5:1-5:7",
        "7:9-7:13",
        "7:15-7:19",
        "13:1-13:5",
        "14:1-14:5",
        "15:1-15:5",
        "11:1-11:6",
        "1:0-1:20",
        "2:0-2:20",
        "3:0-3:20",
        "10:1-10:5",
        "12:1-12:5",
      ],
    },
  ]);

  const settings = {
    data: [{ name: "Sheet1", celldata: [{ r: 0, c: 0, v: null }] }], // sheet data
    onChange: (data: any) => {
      console.log(data);
    }, // onChange event
    lang: "en", // set language
    // More other settings...
  };

  return (
    <>
      <ImportHelper
        setKey={setKey}
        setSheets={setSheets}
        sheetRef={workbookRef}
      />

      <Workbook
        {...settings}
        key={key}
        data={sheets}
        //@ts-ignore

        ref={workbookRef}
        customToolbarItems={[
          exportToolBarItem(workbookRef),
          importToolBarItem(),
        ]}
        config={{
          defaultFontSize: 12,
          defaultFont: "Tahoma",
          defaultAlign: "right",
        }}
      />
    </>
  );
}
